#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьЧерезТокен(Команда)
	Пароль = ПолучитьСекретТокеномНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЧерезПрокси(Команда)
	Пароль = ПолучитьСекретПроксиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСекретТокеномНаСервере()

	Обработка =  РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ЗакрытыйКлюч");

	Токен = Новый ТокенДоступа;
	Токен.Заголовки.Вставить("kid", "onec-demo-key");
	Токен.Эмитент = "onec";
	Токен.Получатели.Добавить("vault");
	Токен.КлючСопоставленияПользователя = "demo-application";
	Токен.ВремяСоздания = ТекущаяУниверсальнаяДата() - Дата(1970, 1, 1);
	Токен.ВремяЖизни = 60;
	Токен.Подписать(АлгоритмПодписиТокенаДоступа.RS256, Макет.ПолучитьТекст());

	Тело = Новый ЗаписьJSON;
	Тело.УстановитьСтроку();
	ЗаписатьJSON(Тело, Новый Структура("role, jwt", "onec-demo", Строка(Токен)));

	Ответ = ЗапросВолт(8200, "POST", "/v1/auth/jwt/login", , Тело.Закрыть());

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-Vault-Token", Ответ.auth.client_token);
	Ответ = ЗапросВолт(8200, "GET", "/v1/secret/data/onec/database", Заголовки);
	Возврат Ответ.data.data.password;

КонецФункции

&НаСервере
Функция ПолучитьСекретПроксиНаСервере()

	Ответ = ЗапросВолт(8100, "GET", "/v1/secret/data/onec/database");
	Возврат Ответ.data.data.password;

КонецФункции

&НаСервере
Функция ЗапросВолт(Порт, Метод, Путь, Заголовки = Неопределено, Тело = Неопределено)

	Запрос = Новый HTTPЗапрос(Путь);
	Если Заголовки <> Неопределено Тогда
		Запрос.Заголовки = Заголовки;
	КонецЕсли;
	Если Тело <> Неопределено Тогда
		Запрос.УстановитьТелоИзСтроки(Тело);
	КонецЕсли;

	Соединение = Новый HTTPСоединение("127.0.0.1", Порт, , , , 10);
	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
	Текст = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение СтрШаблон("HTTP %1: %2", Ответ.КодСостояния, Текст);
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Текст);
	Возврат ПрочитатьJSON(Чтение);

КонецФункции

#КонецОбласти
